; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	image5 - mode
	image2 - mode
	image6 - mode
	spectrograph3 - mode
	thermograph4 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star4 - direction
	Star0 - direction
	GroundStation11 - direction
	Star6 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image6)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 image2)
	(supports instrument1 image6)
	(supports instrument1 image5)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star4)
	(supports instrument3 image6)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star6)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(have_image Planet14 spectrograph3)
	(have_image Planet15 image6)
	(have_image Star16 image5)
	(have_image Star16 image2)
	(have_image Star17 spectrograph3)
	(have_image Star17 thermograph0)
))

)

; plan
1. (switch_on instrument3 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument3)
   goals met: 0 of 6
2. (calibrate satellite0 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 6
4. (turn_to satellite0 planet14 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet14)
   goals met: 0 of 6
5. (take_image satellite0 planet14 instrument3 spectrograph3)
   added: (have_image planet14 spectrograph3)
   goals met: 1 of 6
6. (turn_to satellite0 groundstation5 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 6
7. (turn_to satellite0 planet15 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet15)
   goals met: 1 of 6
8. (take_image satellite0 planet15 instrument3 image6)
   added: (have_image planet15 image6)
   goals met: 2 of 6
9. (turn_to satellite0 groundstation5 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 6
10. (turn_to satellite0 star17 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star17)
   goals met: 2 of 6
11. (take_image satellite0 star17 instrument3 spectrograph3)
   added: (have_image star17 spectrograph3)
   goals met: 3 of 6
12. (take_image satellite0 star17 instrument3 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 4 of 6
13. (switch_off instrument3 satellite0)
   deleted: (power_on instrument3)
   added: (power_avail satellite0)
   goals met: 4 of 6
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 6
15. (turn_to satellite0 groundstation5 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation5)
   goals met: 4 of 6
16. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 4 of 6
17. (turn_to satellite0 star16 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star16)
   goals met: 4 of 6
18. (take_image satellite0 star16 instrument1 image2)
   added: (have_image star16 image2)
   goals met: 5 of 6
19. (take_image satellite0 star16 instrument1 image5)
   added: (have_image star16 image5)
   goals met: 6 of 6
